In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[ 0.19905927,  0.28936177, -0.06972083],
       [-1.9657274 ,  0.26663475,  1.71297515],
       [-0.82210829, -0.79271395, -0.97821395],
       [ 0.78630144, -0.29379876, -0.87919067]])

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

          0         1         2
0  0.199059  0.289362 -0.069721
1 -1.965727  0.266635  1.712975
2 -0.822108 -0.792714 -0.978214
3  0.786301 -0.293799 -0.879191

In [7]:
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
(data_frame[0])

0    0.199059
1   -1.965727
2   -0.822108
3    0.786301
Name: 0, dtype: float64

In [9]:
new_df =pd.DataFrame(data, index = ["Emre", "Zeynep", "Atlas", "Mehmet"], columns=["Salary", "Age", "Seniorty"])

In [13]:
new_df["Age"]

Emre      0.289362
Zeynep    0.266635
Atlas    -0.792714
Mehmet   -0.293799
Name: Age, dtype: float64

In [15]:
new_df[["Age", "Salary"]]

             Age    Salary
Emre    0.289362  0.199059
Zeynep  0.266635 -1.965727
Atlas  -0.792714 -0.822108
Mehmet -0.293799  0.786301

In [16]:
new_df.loc["Emre"]

Salary      0.199059
Age         0.289362
Seniorty   -0.069721
Name: Emre, dtype: float64

In [18]:
new_df.iloc[1]

Salary     -1.965727
Age         0.266635
Seniorty    1.712975
Name: Zeynep, dtype: float64

In [23]:
new_df.iloc[:,1]   # burada tum rowlari sec ve hepsinin 1. column getir dedik. Yani tum isimlerin yaslarini getirdik.

Emre      0.289362
Zeynep    0.266635
Atlas    -0.792714
Mehmet   -0.293799
Name: Age, dtype: float64

In [20]:
new_df.iloc[:,2]

Emre     -0.069721
Zeynep    1.712975
Atlas    -0.978214
Mehmet   -0.879191
Name: Seniorty, dtype: float64

In [24]:
new_df["Extra"] = 10                                       ### yeni bir column ekledik burada

In [25]:
new_df

          Salary       Age  Seniorty  Extra
Emre    0.199059  0.289362 -0.069721     10
Zeynep -1.965727  0.266635  1.712975     10
Atlas  -0.822108 -0.792714 -0.978214     10
Mehmet  0.786301 -0.293799 -0.879191     10

In [26]:
new_df.drop("Extra", axis = 1)

          Salary       Age  Seniorty
Emre    0.199059  0.289362 -0.069721
Zeynep -1.965727  0.266635  1.712975
Atlas  -0.822108 -0.792714 -0.978214
Mehmet  0.786301 -0.293799 -0.879191

In [27]:
new_df

          Salary       Age  Seniorty  Extra
Emre    0.199059  0.289362 -0.069721     10
Zeynep -1.965727  0.266635  1.712975     10
Atlas  -0.822108 -0.792714 -0.978214     10
Mehmet  0.786301 -0.293799 -0.879191     10

In [28]:
new_df.drop("Extra", axis = 1, inplace=True)  ### inplace = True demezsen kalici bir silme gerceklesmicek. 
                                              ### Axis bize row daki mi yoksa column daki mi seyi silmemizi belirtir.

In [29]:
new_df

          Salary       Age  Seniorty
Emre    0.199059  0.289362 -0.069721
Zeynep -1.965727  0.266635  1.712975
Atlas  -0.822108 -0.792714 -0.978214
Mehmet  0.786301 -0.293799 -0.879191

In [30]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniorty
Emre    0.199059  0.289362 -0.069721
Zeynep -1.965727  0.266635  1.712975
Atlas  -0.822108 -0.792714 -0.978214

In [31]:
new_df

          Salary       Age  Seniorty
Emre    0.199059  0.289362 -0.069721
Zeynep -1.965727  0.266635  1.712975
Atlas  -0.822108 -0.792714 -0.978214
Mehmet  0.786301 -0.293799 -0.879191

In [32]:
new_df.loc["Atlas"]

Salary     -0.822108
Age        -0.792714
Seniorty   -0.978214
Name: Atlas, dtype: float64

In [33]:
new_df.loc["Atlas", "Salary"]    ### Mesela burada direk Atlas'in salary'sine ulasabildik.

-0.8221082926667174

In [34]:
new_df.loc["Atlas"]["Salary"]       ### Bu da ikinice secenek.

-0.8221082926667174

In [35]:
new_df.loc["Atlas", "Salary"] = 100                               ### Burada Atlas'in maasini guncelledik.

In [36]:
new_df

            Salary       Age  Seniorty
Emre      0.199059  0.289362 -0.069721
Zeynep   -1.965727  0.266635  1.712975
Atlas   100.000000 -0.792714 -0.978214
Mehmet    0.786301 -0.293799 -0.879191

In [38]:
new_df > 0

        Salary    Age  Seniorty
Emre      True   True     False
Zeynep   False   True      True
Atlas     True  False     False
Mehmet    True  False     False

In [39]:
boolean_frame = new_df > 0

In [40]:
new_df[boolean_frame]

            Salary       Age  Seniorty
Emre      0.199059  0.289362       NaN
Zeynep         NaN  0.266635  1.712975
Atlas   100.000000       NaN       NaN
Mehmet    0.786301       NaN       NaN

In [41]:
new_df[new_df["Age"] > 0]                                  ### burada 0 dan buyuk yaslari getir dedik.

          Salary       Age  Seniorty
Emre    0.199059  0.289362 -0.069721
Zeynep -1.965727  0.266635  1.712975

In [42]:
new_df[new_df["Salary"] > 1]                               ### burada maasi 1 den yuksek olanlari getir dedik.

       Salary       Age  Seniorty
Atlas   100.0 -0.792714 -0.978214

In [43]:
new_df

            Salary       Age  Seniorty
Emre      0.199059  0.289362 -0.069721
Zeynep   -1.965727  0.266635  1.712975
Atlas   100.000000 -0.792714 -0.978214
Mehmet    0.786301 -0.293799 -0.879191

In [44]:
reset_frame = new_df.reset_index()

In [45]:
reset_frame

    index      Salary       Age  Seniorty
0    Emre    0.199059  0.289362 -0.069721
1  Zeynep   -1.965727  0.266635  1.712975
2   Atlas  100.000000 -0.792714 -0.978214
3  Mehmet    0.786301 -0.293799 -0.879191

In [46]:
reset_frame.loc[0]

index           Emre
Salary      0.199059
Age         0.289362
Seniorty   -0.069721
Name: 0, dtype: object

In [48]:
new_indices = ["Emr","Zey","Atl","Meh"]    ## Burada sirasiyla new_indices listesi olusturuldu
                                           ## Daha sonra new_df icine NewIndex column olsuturuldu
                                           ## En son olarak New_indices listesi NewIndex iicne eklendi.

In [49]:
new_df["NewIndex"] = new_indices

In [50]:
new_df

            Salary       Age  Seniorty NewIndex
Emre      0.199059  0.289362 -0.069721      Emr
Zeynep   -1.965727  0.266635  1.712975      Zey
Atlas   100.000000 -0.792714 -0.978214      Atl
Mehmet    0.786301 -0.293799 -0.879191      Meh

In [53]:
new_df.set_index ("NewIndex", inplace=True)   ## Burada NewIndex --> 0 1 2 3 .. yerine gecti .set_index araciligiyla

In [54]:
new_df

              Salary       Age  Seniorty
NewIndex
Emr         0.199059  0.289362 -0.069721
Zey        -1.965727  0.266635  1.712975
Atl       100.000000 -0.792714 -0.978214
Meh         0.786301 -0.293799 -0.879191

In [55]:
new_df.loc["Emr"]

Salary      0.199059
Age         0.289362
Seniorty   -0.069721
Name: Emr, dtype: float64

In [56]:
# multi index

In [57]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [58]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
zipped_index = list (zip(first_index, inner_index))    ## Burada zip ile olustudugumuz listeleri birlestirdik.

In [60]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [62]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [63]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [64]:
sample_values = np.ones((6,2))

In [65]:
sample_values

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [68]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns=["Age","Salary"])

In [69]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [71]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [72]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [73]:
big_df.loc["South Park"].loc["Kyle"]

Age       1.0
Salary    1.0
Name: Kyle, dtype: float64